IDEA StatiCa Open Model
HingeElement1D.InitialStiffnessRX Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Initial stiffness rotational RX
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double InitialStiffnessRX { get; set; }
Public Property InitialStiffnessRX As Double
	Get
	Set
public:
property double InitialStiffnessRX {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
HingeElement1D Class
IdeaRS.OpenModel.Model Namespace